{
  "_name_or_path": "vinai/phobert-base",
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "S\u1ea0CH",
    "1": "CH\u1eecI B\u1edaI",
    "2": "K\u00cdCH \u0110\u1ed8NG",
    "3": "SPAM"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "CH\u1eecI B\u1edaI": 1,
    "K\u00cdCH \u0110\u1ed8NG": 2,
    "SPAM": 3,
    "S\u1ea0CH": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 258,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "tokenizer_class": "PhobertTokenizer",
  "torch_dtype": "float32",
  "transformers_version": "4.44.2",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 64001
}
